Repository: cran/tcltk2
Catalog: po/R-*.po
Languages: de

source: 'f' must be a function!
de: 'f' muss eine Funktion sein!

source: The function used cannot (yet) have arguments!
de: Die benutzte Funktion kann (noch) keine Argumente haben!

source: 'name' must be a character string!
de: 'name' muss eine Zeichenkette sein!

source: 'name' must be a character!
de: 'name' muss ein Zeichen sein!

source: Error when getting the value in the '%s' Tcl variable
de: Fehler beim Holen des Werts in der Tcl-Variable »%s«

source: Error when changing the value of the '%s' Tcl variable
de: Fehler beim Ändern des Werts der Tcl-Variable »%s«

source: This is a Windows-specific function!
de: Dies ist eine Windows-spezifische Funktion!

source: This version of R cannot use Tcl/Tk!
de: Diese Version von R kann Tcl/Tk nicht benutzen!

source: Unable to find the 'dde' Tcl/tk package!
de: Das Tcl/Tk-Paket 'dde' konnte nicht gefunden werden!

source: 'topic' must be a non null character string!
de: 'topic' muss eine Zeichenkette ungleich Null sein!

source: 'service', 'topic' and 'command' must be character strings!
de: 'service', 'topic' und »command« müssen Zeichenketten sein!

source: 'service' and 'topic' must be character strings!
de: 'service' und 'topic' müssen Zeichenketten sein!

source: 'item' must be character strings!
de: 'item' müssen Zeichenketten sein!

source: 'iconfile' must be of length one!
de: 'iconfile' muss die Länge eins haben!

source: File '%s' not found!
de: Datei '%s' nicht gefunden!

source: Error creating the icon resource; probably wrong 'iconfile'
de: Fehler beim Erstellen der Icon-Quelle; möglicherweise falsches 'iconfile'

source: 'icon' is not a "tclIcon" object!
de: 'icon' ist kein "tclIcon"-Objekt!

source: Error getting the icon handle for a "tclIcon" object!
de: Fehler beim Holen eines Icon-Handles für ein "tclIcon"-Objekt!

source: Impossible to retrieve icon resource information!
de: Fehler beim Abrufen der Icon-Ressourceinformationen!

source: 'file' must be of length one!
de: 'file' muss die Länge eins haben!

source: 'res' must be of length one!
de: 'res' muss die Länge eins haben!

source: Unable to load the icon resource, 'file' or 'res' is wrong!
de: Icon-Ressource kann nicht geladen werden 'file' oder 'res' ist falsch!

source: 'value' must be numeric and of length one!
de: 'value' muss numerisch sein und die Länge eins haben!

source: Error while changing default position of the icon!
de: Fehler beim Ändern der Standardposition des Icons!

source: 'win' is not a "tkwin" object, or an integer (Window handle)!
de: 'win' ist kein "tkwin"-Objekt oder eine Ganzzahl (Fenster-Handle)!

source: 'pos' must be numeric and of length one, or NULL!
de: 'pos' muss numerisch sein und die Länge eins haben oder NULL sein!

source: 'leftmenu' must be a "tkwin" object or NULL!
de: 'leftmenu' muss ein »tkwin«-Objekt oder NULL sein!

source: 'rightmenu' must be a "tkwin" object or NULL!
de: 'rightmenu' muss ein »tkwin«-Objekt oder NULL sein!

source: Error while creating the callback for this icon!
de: Fehler beim Erzeugen der Rückruffunktion für dieses Icon!

source: Error getting the text associated with an icon!
de: Fehler beim Holen des zu diesem Icon gehörenden Textes!

source: 'value' must not be empty or NULL!
de: 'value' darf nicht leer oder NULL sein!

source: Error while changing text of the icon!
de: Fehler beim Ändern des Icon-Textes!

source: Unable to find the 'registry' Tcl/tk package!
de: Das Tcl/Tk-Paket 'registry' konnte nicht gefunden werden!

source: Unrecognized 'type'!
de: Unbekannter 'type'!
